In [8]:
import json
import pandas as pd
import requests

# 1

In [87]:
df = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/US_Crime_Rates/US_Crime_Rates_1960_2014.csv')

In [88]:
df.head()

,Year,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
0,1960,179323175,3384200,288460,3095700,9110,17190,107840,154320,912100,1855400,328200
1,1961,182992000,3488000,289390,3198600,8740,17220,106670,156760,949600,1913000,336000
2,1962,185771000,3752200,301510,3450700,8530,17550,110860,164570,994300,2089600,366800
3,1963,188483000,4109500,316970,3792500,8640,17650,116470,174210,1086400,2297800,408300
4,1964,191141000,4564600,364220,4200400,9360,21420,130390,203050,1213200,2514400,472800

In [89]:
max(df['Year'])

2014

In [90]:
steal = ['Robbery', 'Burglary', 'Larceny_Theft', 'Vehicle_Theft']

In [91]:
#summing all 'stealing' crimes
sum = df[steal].sum(axis = 1)

In [92]:
#percentage of 'stealing' crimes out of all crimes
df['Percentage of stealing per all crimes'] = sum / df['Total']

In [93]:
df.head()

,Year,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft,Percentage of stealing per all crimes
0,1960,179323175,3384200,288460,3095700,9110,17190,107840,154320,912100,1855400,328200,0.946617
1,1961,182992000,3488000,289390,3198600,8740,17220,106670,156760,949600,1913000,336000,0.947612
2,1962,185771000,3752200,301510,3450700,8530,17550,110860,164570,994300,2089600,366800,0.949192
3,1963,188483000,4109500,316970,3792500,8640,17650,116470,174210,1086400,2297800,408300,0.951203
4,1964,191141000,4564600,364220,4200400,9360,21420,130390,203050,1213200,2514400,472800,0.948778

In [94]:
#percentage of murders + violent per population
df['Percent of murdered +violent per population'] = (df['Murder'] + df['Violent']) / df['Population']

In [95]:
df.head()

,Year,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft,Percentage of stealing per all crimes,Percent of murdered per population
0,1960,179323175,3384200,288460,3095700,9110,17190,107840,154320,912100,1855400,328200,0.946617,0.001659
1,1961,182992000,3488000,289390,3198600,8740,17220,106670,156760,949600,1913000,336000,0.947612,0.001629
2,1962,185771000,3752200,301510,3450700,8530,17550,110860,164570,994300,2089600,366800,0.949192,0.001669
3,1963,188483000,4109500,316970,3792500,8640,17650,116470,174210,1086400,2297800,408300,0.951203,0.001728
4,1964,191141000,4564600,364220,4200400,9360,21420,130390,203050,1213200,2514400,472800,0.948778,0.001954

In [104]:
#Info about year where was maximum of murders + violent
df[(df['Murder'] + df['Violent']) == max(df['Murder'] + df['Violent'])]

,Year,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft,Percentage of stealing per all crimes,Percent of murdered per population
32,1992,255082000,14438200,1932270,12505900,23760,109060,672480,1126970,2979900,7915200,1610800,0.912744,0.007668

# 2

In [105]:
df2 = pd.read_csv('https://raw.githubusercontent.com/vincentarelbundock/Rdatasets/master/datasets.csv')

In [132]:
df2.head()

,Package,Item,Title,Rows,Cols,n_binary,n_character,n_factor,n_logical,n_numeric,CSV,Doc
0,AER,Affairs,Fair's Extramarital Affairs Data,601,9,2,0,2,0,7,https://vincentarelbundock.github.io/Rdatasets...,https://vincentarelbundock.github.io/Rdatasets...
1,AER,ArgentinaCPI,Consumer Price Index in Argentina,80,2,0,0,0,0,2,https://vincentarelbundock.github.io/Rdatasets...,https://vincentarelbundock.github.io/Rdatasets...
2,AER,BankWages,Bank Wages,474,4,2,0,3,0,1,https://vincentarelbundock.github.io/Rdatasets...,https://vincentarelbundock.github.io/Rdatasets...
3,AER,BenderlyZwick,"Benderly and Zwick Data: Inflation, Growth and...",31,5,0,0,0,0,5,https://vincentarelbundock.github.io/Rdatasets...,https://vincentarelbundock.github.io/Rdatasets...
4,AER,BondYield,Bond Yield Data,60,2,0,0,0,0,2,https://vincentarelbundock.github.io/Rdatasets...,https://vincentarelbundock.github.io/Rdatasets...

In [138]:
#first 5 datasets with maximum Rows
df2.sort_values(by = 'Rows', ascending = False)[:5]

,Package,Item,Title,Rows,Cols,n_binary,n_character,n_factor,n_logical,n_numeric,CSV,Doc
1157,openintro,military,US Military Demographics,1414593,6,2,0,4,1,1,https://vincentarelbundock.github.io/Rdatasets...,https://vincentarelbundock.github.io/Rdatasets...
1007,mosaicData,Birthdays,US Births in 1969 - 1988,372864,7,0,1,1,0,4,https://vincentarelbundock.github.io/Rdatasets...,https://vincentarelbundock.github.io/Rdatasets...
1642,stevedata,wvs_justifbribe,Attitudes about the Justifiability of Bribe-Ta...,348532,6,0,1,0,0,5,https://vincentarelbundock.github.io/Rdatasets...,https://vincentarelbundock.github.io/Rdatasets...
1041,nycflights13,flights,Flights data,336776,19,0,4,0,0,14,https://vincentarelbundock.github.io/Rdatasets...,https://vincentarelbundock.github.io/Rdatasets...
1641,stevedata,wvs_immig,Attitudes about Immigration in the World Value...,310388,6,0,1,0,0,5,https://vincentarelbundock.github.io/Rdatasets...,https://vincentarelbundock.github.io/Rdatasets...

# 3

In [154]:
df3 = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/beer.txt', sep = ' ')

In [155]:
df3.head()

          name  calories  sodium  alcohol  cost
0    Budweiser       144      15      4.7  0.43
1      Schlitz       151      19      4.9  0.43
2    Lowenbrau       157      15      0.9  0.48
3  Kronenbourg       170       7      5.2  0.73
4     Heineken       152      11      5.0  0.77

In [156]:
#in order to consume as much alcohol as we can let's compute the price of 1% of alcohol for each position and pick 3 cheapest 
df3['Price of 1% of alcohol'] = df3['cost'] / df3['alcohol']

In [157]:
df3.head()

          name  calories  sodium  alcohol  cost  Price of 1% of alcohol
0    Budweiser       144      15      4.7  0.43                0.091489
1      Schlitz       151      19      4.9  0.43                0.087755
2    Lowenbrau       157      15      0.9  0.48                0.533333
3  Kronenbourg       170       7      5.2  0.73                0.140385
4     Heineken       152      11      5.0  0.77                0.154000

In [158]:
#lets sort and pick first 3 products
df3.sort_values(by = 'Price of 1% of alcohol', ascending = True)[:3]

            name  calories  sodium  alcohol  cost  Price of 1% of alcohol
5  Old_Milwaukee       145      23      4.6  0.28                0.060870
6     Augsberger       175      24      5.5  0.40                0.072727
1        Schlitz       151      19      4.9  0.43                0.087755

# 4

In [185]:
df4 = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv', sep = '\t')

In [186]:
df4.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [187]:
x = df4['item_price']

In [188]:
dollar_str = lambda x: x.replace('$', '')
df4_dollar_str = df4['item_price'].apply(dollar_str)

In [189]:
dollar_float = lambda x: float(x)

In [190]:
df4['Dollars'] = df4_dollar_str.apply(dollar_float)

In [191]:
df4.head()

,order_id,quantity,item_name,choice_description,item_price,Dollars
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39,2.39
1,1,1,Izze,[Clementine],$3.39,3.39
2,1,1,Nantucket Nectar,[Apple],$3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,16.98

In [193]:
df4['Total_price'] = df4['Dollars'] * df4['quantity']

In [194]:
df4.head()

,order_id,quantity,item_name,choice_description,item_price,Dollars,Total_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39,2.39,2.39
1,1,1,Izze,[Clementine],$3.39,3.39,3.39
2,1,1,Nantucket Nectar,[Apple],$3.39,3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,16.98,33.96